Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
Constructs a new copy of the input AnalysisDisplayVectorSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012